Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Заказ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФНФ_Клиент.ОткрытьФормуВоВложенной(Элементы.ПодборНоменклатуры, "Справочник.Номенклатура.Форма.ФормаПодбора");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатурыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Сообщение = ФНФ_Клиент.СообщениеОтВложенной(Элемент, ДанныеСобытия);
	Если ПустаяСтрока(Сообщение) Тогда
		Возврат;
	КонецЕсли; 
	
	Части = СтрРазделить(Сообщение, ":", Истина);
	УнИд = Части[0];
	Колво = Части[1];
	
	Товар = ПолучитьНоменклатуру(УнИд);
	НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Товар));
	
	Если ПустаяСтрока(Колво) Тогда //Получение кол-ва
		
		ТекКолво = ?(НайдСтроки.Количество() = 0, 1, НайдСтроки[0].Количество);
		ФНФ_Клиент.ВыполнитьОповещениеВложенной(Элементы.ПодборНоменклатуры, "Форма", "ВводКоличества", ТекКолво);
				
	Иначе //Установка кол-ва
		
		Если НайдСтроки.Количество() = 0 Тогда
			ТекСтрока = Объект.Товары.Добавить();
			ТекСтрока.Номенклатура = Товар;
		Иначе
			ТекСтрока = НайдСтроки[0];
		КонецЕсли;
		ТекСтрока.Количество = Число(Колво);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуру(СтрокаУнИд)
	
	УнИд = Новый УникальныйИдентификатор(СтрокаУнИд);
	Возврат Справочники.Номенклатура.ПолучитьСсылку(УнИд);
		
КонецФункции
